# Built In Failures Electrical Failures Circuit Become ASpare Property

Source: https://www.revitapidocs.com/2026/f0dd83c3-ed3f-7d08-0a40-e0a9eed8c4dd.htm

---

| Built In Failures Electrical Failures Circuit Become ASpare Property |
| --- |

Circuit \[Circuit Name] in \[Panel Name] has become a spare because all connected elements have been disconnected. Click Delete if you want to remove the Spare, click OK to preserve the Spare..
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CircuitBecomeASpare { get; }
```

```
Public Shared ReadOnly Property CircuitBecomeASpare As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CircuitBecomeASpare {
	FailureDefinitionId^ get ();
}
```

```
static member CircuitBecomeASpare : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ElectricalFailures Class Autodesk.Revit.DB Namespace